#+STARTUP: showall
#+STARTUP: lognotestate
#+TAGS: research(r) uvic(u) today(y) todo(t) cooking(c)
#+SEQ_TODO: TODO(t) STARTED(s) DEFERRED(r) CANCELLED(c) | WAITING(w) DELEGATED(d) APPT(a) DONE(d)
#+DRAWERS: HIDDEN STATE
#+ARCHIVE: %s_done::
#+TITLE: 
#+CATEGORY: 
#+PROPERTY: header-args:sql             :engine postgresql  :exports both :cmdline csc370
#+PROPERTY: header-args:sqlite          :db /path/to/db  :colnames yes
#+PROPERTY: header-args:C++             :results output :flags -std=c++17 -Wall --pedantic -Werror
#+PROPERTY: header-args:R               :results output  :colnames yes
#+PROPERTY: header-args:python          :results output  :exports both
#+OPTIONS: ^:nil
#
#
# Documentation: https://orgmode.org/manual/index.html#Top
#
# Types of results: https://orgmode.org/manual/Results-of-Evaluation.html#Results-of-Evaluation
#  :type  list, scalar,  verbatim, file, 
#  :format code, drawer, html, latex, link, graphics,  org, pp, raw
#  :exports code, both, results, none
#
# library of babel: maybe the answer is there:
#  https://orgmode.org/worg/library-of-babel.html





Addons


|   182970692 | AJT Browser Play Button                    |   | 2021-09-30 Thu |                                             |
|   278530045 | Migaku  Japanese                           |   | 2021-09-30 Thu | Some warning windows might are not be shown |
|   817108664 | Anki Simulator                             |   | 2021-09-30 Thu |                                             |
|   819023663 | RefoldEase                                 |   | 2021-09-30 Thu |                                             |
|   909972618 | Kanji Grid                                 |   | 2021-09-30 Thu |                                             |
|  1021636467 | Learn now Button                           |   | 2021-09-30 Thu |                                             |
|  1250448937 | Kakijun - Kanji stroke order               |   | 2021-09-30 Thu |                                             |
|  1255924302 | AJT Mortician                              |   | 2021-09-30 Thu |                                             |
|  1582755932 | Kanji Keyword Overlay anki 21              |   | 2021-09-30 Thu |                                             |
|  1655992655 | Migaku Japanese                            |   | 2021-09-30 Thu | MOdified to run in Anki 47                  |
|  1655992655 | Migaku Dictionary Plus                     |   | 2021-09-30 Thu | MOdified to run in Anki 47                                            |
|  1779060522 | True Retention by Card Maturity Simplified |   | 2021-09-30 Thu |                                             |
|  2055492159 | Anki Connect                               |   | 2021-09-30 Thu |                                             |


TO be added:

|             | Automatically Flip Cards |   |                | Updated to properly account for audio in card |
| MecabUnidic |                          |   | 2021-09-30 Thu |                                               |
| MorphMan    |                          |   | 2021-09-30 Thu |                                               |


My own addons

|   dmgFilter |                                            | 2021-09-30 Thu |                                             |
|    dmgKanji |                                            | 2021-09-30 Thu |                                             |
  
#+begin_src sqlite :db /tmp/rip1022.db :results output
select 1 + 2;
#+end_src

#+RESULTS:
#+begin_example
3
#+end_example

#+begin_src C++ :main no :results output :flags -std=c++17 -Wall --pedantic -Werror
#include <iostream>
int main(void)
{
   std::cout << "Hello world" << std::endl;

   return 0;
}
#+end_src

#+RESULTS:
#+begin_example
Hello world
#+end_example
